duxinglang-1/nRF9160_test/E2_V3_IMU_TEST/src/imu/lsm6dso.c
static uint8_t init_i2c(void)
{
	i2c_imu = device_get_binding(IMU_DEV);
	if(!i2c_imu)
	{
	#ifdef IMU_DEBUG
		LOGD("ERROR SETTING UP I2C");
	#endif
		return -1;
	}
	else
	{
		i2c_configure(i2c_imu, I2C_SPEED_SET(I2C_SPEED_FAST));
		return 0;
	}
}

static int32_t platform_write(void *handle, uint8_t reg, uint8_t* bufp, uint16_t len)
{
	uint32_t rslt = 0;
	uint8_t data[len+1];

	data[0] = reg;
	memcpy(&data[1], bufp, len);
	rslt = i2c_write(i2c_imu, data, len+1, LSM6DSO_I2C_ADD);

	return rslt;
}

static int32_t platform_read(void *handle, uint8_t reg, uint8_t* bufp, uint16_t len)
{
	uint32_t rslt = 0;

	rslt = i2c_write(i2c_imu, &reg, 1, LSM6DSO_I2C_ADD);
	if(rslt == 0)
	{
		rslt = i2c_read(i2c_imu, bufp, len, LSM6DSO_I2C_ADD);
	}

	return rslt;
}

void interrupt_event(struct device *interrupt, struct gpio_callback *cb, uint32_t pins)
{
	int2_event = true;
}

void step_event(struct device *interrupt, struct gpio_callback *cb, uint32_t pins)
{
	int1_event = true;
}

void init_imu_int1(void)
{
	if(gpio_imu == NULL)
		gpio_imu = device_get_binding(IMU_PORT);
	gpio_pin_configure(gpio_imu, LSM6DSO_INT1_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_imu, LSM6DSO_INT1_PIN, 0);
}

uint8_t init_gpio(void)
{
	gpio_flags_t flag = GPIO_INPUT|GPIO_PULL_DOWN;

	if(gpio_imu == NULL)
		gpio_imu = device_get_binding(IMU_PORT);
	
	//steps&tilt interrupt
	gpio_pin_configure(gpio_imu, LSM6DSO_INT1_PIN, flag);
    gpio_pin_interrupt_configure(gpio_imu, LSM6DSO_INT1_PIN, GPIO_INT_DISABLE);
	gpio_init_callback(&gpio_cb1, step_event, BIT(LSM6DSO_INT1_PIN));
	gpio_add_callback(gpio_imu, &gpio_cb1);
    gpio_pin_interrupt_configure(gpio_imu, LSM6DSO_INT1_PIN, GPIO_INT_ENABLE|GPIO_INT_EDGE_RISING);

#ifdef CONFIG_FALL_DETECT_SUPPORT
	//fall interrupt
	gpio_pin_configure(gpio_imu, LSM6DSO_INT2_PIN, flag);
    gpio_pin_interrupt_configure(gpio_imu, LSM6DSO_INT2_PIN, GPIO_INT_DISABLE);
	gpio_init_callback(&gpio_cb2, interrupt_event, BIT(LSM6DSO_INT2_PIN));
	gpio_add_callback(gpio_imu, &gpio_cb2);
    gpio_pin_interrupt_configure(gpio_imu, LSM6DSO_INT2_PIN, GPIO_INT_ENABLE|GPIO_INT_EDGE_RISING);
#endif

	return 0;
}

void initActivityLib(void){
  MotionAW_Initialize();
  MotionAW_Reset();
  MotionAW_Reset_Activity_Duration();
}

void initStepLib(void){
  MotionPW_Initialize();
  MotionPW_ResetStepCount();
  MotionPW_ResetPedometerLibrary();
}

void getActivityLibVer(void){
  MotionAW_GetLibVersion(lib_ver);
  #ifdef IMU_DEBUG
  LOGD("Activity Library Version is: %s\n", lib_ver);
  #endif
}

void getStepLibVer(void){
  MotionPW_GetLibVersion(lib_ver);
  #ifdef IMU_DEBUG
  LOGD("Step Library Version is: %s\n", lib_ver);
  #endif
}

void setOrientationAW(void){
  char acc_orientation[3];

  acc_orientation[0] = 'e';
  acc_orientation[1] = 'n';
  acc_orientation[2] = 'u';

  MotionAW_SetOrientation_Acc(acc_orientation);
}

int runActivityAlgorithms(float accX, float accY, float accZ)
{
  MAW_input_t MAW_data_in = {.AccX = 0.0f, .AccY = 0.0f, .AccZ = 0.0f};
  MAW_output_t MAW_data_out;
  
  static int32_t activity_conversion = 0;
  static uint8_t resampling = 0;

  MAW_data_in.AccX = MPW_data_in.AccX = accX;
  MAW_data_in.AccY = MPW_data_in.AccY = accY;
  MAW_data_in.AccZ = MPW_data_in.AccZ = accZ;

  resampling++;
  if (resampling == 3U)
  {
    // Get current activity
    MotionAW_Update(&MAW_data_in, &MAW_data_out, timeStamp);

    // Convert current activity number
    activity_conversion = (int32_t)MAW_data_out.current_activity - 4;
    if (activity_conversion < (int32_t)MPW_UNKNOWN_ACTIVITY || activity_conversion > (int32_t)MPW_JOGGING)
    {
      activity_conversion = (int32_t)MPW_UNKNOWN_ACTIVITY;
    }
    MPW_data_in.CurrentActivity = (MPW_activity_t)activity_conversion;
    #ifdef IMU_DEBUG
    //LOGD("Current Activity: %d\n", MPW_data_in.CurrentActivity);
    #endif

    resampling = 0;
  }

  #ifdef CONFIG_STEP_SUPPORT
  MotionPW_Update(&MPW_data_in, &MPW_data_out);
  #endif

  timeStamp += (int64_t)reportInterval;

  #ifdef IMU_DEBUG
    LOGD("Steps: %d\n", MPW_data_out.Nsteps);
    //LOGD("Cadence: %d\n", MPW_data_out.Cadence);
    //LOGD("Confidence: %d\n", MPW_data_out.Confidence);
  #endif

  return 0;
}

/* ULTRA LOW POWER & INACTIVITY MODE IMPLEMENTED. FIFO DISABLED*/
static bool sensor_init(void)
{
	k_sleep(K_MSEC(BOOT_TIME));

	lsm6dso_device_id_get(&imu_dev_ctx, &whoamI);
	if(whoamI != LSM6DSO_ID)
		return false;

	lsm6dso_reset_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_reset_get(&imu_dev_ctx, &rst);

	lsm6dso_i3c_disable_set(&imu_dev_ctx, LSM6DSO_I3C_DISABLE);
	lsm6dso_block_data_update_set(&imu_dev_ctx, PROPERTY_ENABLE);

	lsm6dso_xl_data_rate_set(&imu_dev_ctx, LSM6DSO_XL_ODR_OFF);
	lsm6dso_gy_data_rate_set(&imu_dev_ctx, LSM6DSO_GY_ODR_OFF);

	lsm6dso_xl_power_mode_set(&imu_dev_ctx, LSM6DSO_ULTRA_LOW_POWER_MD);

	lsm6dso_xl_full_scale_set(&imu_dev_ctx, LSM6DSO_4g);
	lsm6dso_gy_full_scale_set(&imu_dev_ctx, LSM6DSO_250dps);

	lsm6dso_fifo_watermark_set(&imu_dev_ctx, 52);
	lsm6dso_fifo_stop_on_wtm_set(&imu_dev_ctx, PROPERTY_ENABLE);

	lsm6dso_fifo_xl_batch_set(&imu_dev_ctx, LSM6DSO_XL_BATCHED_AT_52Hz);
	lsm6dso_fifo_gy_batch_set(&imu_dev_ctx, LSM6DSO_GY_NOT_BATCHED);

	lsm6dso_fifo_mode_set(&imu_dev_ctx, LSM6DSO_STREAM_TO_FIFO_MODE);

	lsm6dso_xl_data_rate_set(&imu_dev_ctx, LSM6DSO_XL_ODR_52Hz);
	lsm6dso_gy_data_rate_set(&imu_dev_ctx, LSM6DSO_GY_ODR_OFF);

	lsm6dso_tap_detection_on_z_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_tap_detection_on_y_set(&imu_dev_ctx, PROPERTY_ENABLE);
	lsm6dso_tap_detection_on_x_set(&imu_dev_ctx, PROPERTY_ENABLE);

	lsm6dso_tap_threshold_x_set(&imu_dev_ctx, 0x12);
	lsm6dso_tap_threshold_y_set(&imu_dev_ctx, 0x12);
	lsm6dso_tap_threshold_z_set(&imu_dev_ctx, 0x12);

	lsm6dso_tap_quiet_set(&imu_dev_ctx, 0x03);
	lsm6dso_tap_shock_set(&imu_dev_ctx, 0x03);

	lsm6dso_tap_mode_set(&imu_dev_ctx, LSM6DSO_ONLY_SINGLE);

	//lsm6dso_all_sources_get(&imu_dev_ctx, &all_source);

	// ULTRA LOW POWER & INACTIVITY MODE
	//lsm6dso_xl_power_mode_set(&imu_dev_ctx, LSM6DSO_ULTRA_LOW_POWER_MD);
	/* Set duration for Activity detection to 38 ms (= 1 * 1 / ODR_XL) */
	//lsm6dso_wkup_dur_set(&imu_dev_ctx, 0x01);
	/* Set duration for Inactivity detection to 19.69 s (= 1 * 512 / ODR_XL) */
	//lsm6dso_act_sleep_dur_set(&imu_dev_ctx, 0x01);
	/* Set Activity/Inactivity threshold to 312.5 mg */
	//lsm6dso_wkup_threshold_set(&imu_dev_ctx, 0x05);
	/* Inactivity configuration: XL to 12.5 in LP, gyro to Power-Down */
	//lsm6dso_act_mode_set(&imu_dev_ctx, LSM6DSO_XL_12Hz5_GY_PD);
	/* Enable interrupt generation on Inactivity INT1 pin */
	//lsm6dso_pin_int1_route_get(&imu_dev_ctx, &int1_route);
	//int1_route.md1_cfg.int1_sleep_change = PROPERTY_ENABLE; 
	//lsm6dso_pin_int1_route_set(&imu_dev_ctx, &int1_route);

	lsm6dso_int_notification_set(&imu_dev_ctx, LSM6DSO_BASE_PULSED_EMB_LATCHED);

	/*Step Counter enable*/
	//lsm6dso_pin_int1_route_get(&imu_dev_ctx, &int1_route);
	//int1_route.emb_func_int1.int1_step_detector = PROPERTY_ENABLE;
	//lsm6dso_pin_int1_route_set(&imu_dev_ctx, &int1_route);
	/* Enable False Positive Rejection. */
	//lsm6dso_pedo_sens_set(&imu_dev_ctx, LSM6DSO_FALSE_STEP_REJ); 
	//lsm6dso_steps_reset(&imu_dev_ctx);

	/* Tilt enable */
	lsm6dso_long_cnt_int_value_set(&imu_dev_ctx, 0x0000U);
	lsm6dso_fsm_start_address_set(&imu_dev_ctx, LSM6DSO_START_FSM_ADD);
	lsm6dso_fsm_number_of_programs_set(&imu_dev_ctx, 2);
	lsm6dso_fsm_enable_get(&imu_dev_ctx, &fsm_enable);
	fsm_enable.fsm_enable_a.fsm1_en = PROPERTY_ENABLE;
	fsm_enable.fsm_enable_a.fsm2_en = PROPERTY_ENABLE;
	lsm6dso_fsm_enable_set(&imu_dev_ctx, &fsm_enable);  
	lsm6dso_fsm_data_rate_set(&imu_dev_ctx, LSM6DSO_ODR_FSM_26Hz);
	fsm_addr = LSM6DSO_START_FSM_ADD;
	lsm6dso_ln_pg_write(&imu_dev_ctx, fsm_addr, (uint8_t*)lsm6so_prg_wrist_tilt, sizeof(lsm6so_prg_wrist_tilt));
	fsm_addr += sizeof(lsm6so_prg_wrist_tilt);
	//lsm6dso_ln_pg_write(&imu_dev_ctx, fsm_addr, (uint8_t*)falltrigger, sizeof(falltrigger));

	/* wrist single tap, wrist tilt to INT2 pin*/
	lsm6dso_pin_int2_route_get(&imu_dev_ctx, &int2_route);
	//int2_route.fsm_int2_a.int2_fsm1 = PROPERTY_ENABLE;
	//int2_route.fsm_int2_a.int2_fsm2 = PROPERTY_ENABLE;
	int2_route.md2_cfg.int2_single_tap = PROPERTY_ENABLE;
	lsm6dso_pin_int2_route_set(&imu_dev_ctx, &int2_route);

